{
  "people": [
    {
      "url": "https://www.legacy.com/us/obituaries/jsonline/name/maxine-kaczmarowski-obituary?id=3326788",
      "obituary_text": "Maxine Kaczmarowski Obituary (2018) - Milwaukee, WI - Milwaukee Journal Sentinel <iframe src=\"//www.googletagmanager.com/ns.html?id=GTM-TDQHZW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Menu Search by Name Search by Name Add a Memory Send Flowers Make a Donation Share Obituary Sign the Guest Book Send Flowers Share Kaczmarowski / Maxine Kaczmarowski Kaczmarowski / Maxine Kaczmarowski Maxine V. Kaczmarowski Send Flowers Follow Share FUNERAL HOME Rozga Funeral Home & Cremation Services - Rozga-Walloch Chapel 4309 South 20th St Milwaukee, Wisconsin Maxine Kaczmarowski Obituary Kaczmarowski, Maxine V. (NEE Paradowski) Reunited with her husband Terrence and daughter Patricia on May 24, 2018 at the age of 87 years. Survived by her faithful son-in-law Steve Blundon; grandchildren Ryan (Amy) Blundon and Megan (Ross) Wurz; great-grandchildren Autumn, Caralyn and Finley; and brothers Reginald (Donna) Paradowski and Joseph (Rosemary) Paradowski. Also survived by other relatives and friends. Maxine was always up for Bingo, loved traveling the world and made the best walnut torte, chicken dumpling soup and apple pie. Visitation Wednesday, May 30 from 9:30 to 10:30 AM at ST. ROMAN CHURCH (1810 W. Bolivar Ave) followed by the Celebration of Mass of Christian Burial at 10:30 AM. Interment St. Adalbert Cemetery. To plant trees in memory, please visit the Sympathy Store . Published by Milwaukee Journal Sentinel on May 27, 2018. Sign the Guest Book Memories and Condolences for Maxine Kaczmarowski Sponsored by Rozga Funeral Home & Cremation Services - Rozga-Walloch Chapel . Expand the Memories and Condolences form. Not sure what to say? Submit Your Message How do you know Maxine V. Kaczmarowski? (Optional) Family Friend Work School Other From Your Email (will not be displayed) Get email updates for this page Submit Your Message 0 Entries Be the first to post a memory or condolences. Make a Donation in Maxine Kaczmarowski's name Memorial Events for Maxine Kaczmarowski May 30 Visitation 9:30 a.m. - 10:30 a.m. ST. ROMAN CHURCH 1810 W. Bolivar Ave, WI Send Flowers May 30 Mass of Christian Burial 10:30 a.m. ST. ROMAN CHURCH 1810 W. Bolivar Ave, WI Send Flowers Funeral services provided by: Rozga Funeral Home & Cremation Services - Rozga-Walloch Chapel 4309 South 20th St, Milwaukee, WI 53221 Call: (414) 281-7145 How to support Maxine's loved ones Honor a beloved veteran with a special tribute of ‘Taps’ at the National WWI Memorial in Washington, D.C. The nightly ceremony in Washington, D.C. will be dedicated in honor of your loved one on the day of your choosing. Read more Attending a Funeral: What to Know You have funeral questions, we have answers. Read more Should I Send Sympathy Flowers? What kind of arrangement is appropriate, where should you send it, and when should you send an alternative? Read more What Should I Write in a Sympathy Card? We'll help you find the right words to comfort your family member or loved one during this difficult time. Read more View All Resources to help you cope with loss Estate Settlement Guide If you’re in charge of handling the affairs for a recently deceased loved one, this guide offers a helpful checklist. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituaries, grief & privacy: Legacy’s news editor on NPR podcast Legacy's Linnea Crowther discusses how families talk about causes of death in the obituaries they write. Read more The Five Stages of Grief They're not a map to follow, but simply a description of what people commonly feel. Read more View All Ways to honor Maxine Kaczmarowski's life and legacy Obituary Examples You may find these well-written obituary examples helpful as you write about your own family. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituary Templates – Customizable Examples and Samples These free blank templates make writing an obituary faster and easier. Read more How Do I Write a Eulogy? Some basic help and starters when you have to write a tribute to someone you love. Read more View All Recent deaths in the news Gerry Connolly (1950–2025), congressman from Virginia Read more Kathleen Hughes (1928–2025), 1950s scream queen Read more George Wendt (1948–2025), Norm from Cheers Read more Kit Bond (1939–2025), former governor and U.S. Senator from Missouri Read more View All More ways to support the family Visit the Sympathy Shop Show your sympathy by sending flowers. Send Your Arrangement Plant a tree in memory of Maxine. Choose Your Tree Dedicate a star in Maxine's name. Name a Star Donate to charity in honor of Maxine. Make a Donation Submit an Obituary Contact Us FAQ Privacy Policy Terms of Use © 2025 Legacy.com All rights reserved.",
      "first_name": "Maxine",
      "last_name": "Milwaukee",
      "middle_name": "Kaczmarowski Obituary (2018) -",
      "suffix": "V",
      "nickname": "//www.googletagmanager.com/ns.html?id=GTM-TDQHZW"
    },
    {
      "id": "P0001",
      "first_name": "Joseph",
      "last_name": "Milwaukee",
      "url": "https://www.legacy.com/us/obituaries/name/joseph-paradowski-obituary?id=58402784",
      "birth_date": "16 Feb 1941",
      "death_date": "11 May 2025",
      "location": "Milwaukee, WI",
      "name": "Joseph George \"Joe\" Paradowski",
      "obituary_text": "Joseph George \"Joe\" Paradowski Obituary (2025) - Milwaukee, WI - Bruskiewitz Funeral Home - Milwaukee <iframe src=\"//www.googletagmanager.com/ns.html?id=GTM-TDQHZW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Menu Add a Memory Send Flowers Make a Donation Share Obituary Sign the Guest Book Send Flowers Share Paradowski / Joseph Paradowski Paradowski / Joseph Paradowski Joseph George \"Joe\" Paradowski Joseph George \"Joe\" Paradowski Send Flowers Follow Share Obituary 4 Guest Book Joseph Paradowski Obituary Obituary published on Legacy.com by Bruskiewitz Funeral Home - Milwaukee on May 15, 2025. Publish in a newspaper Born February 16th, 1941. Passed away unexpectedly while mowing grass on May 11th, 2025, awaiting a Mother's Day Celebration in Heaven. Survived by Rosemary Dompke, his constant companion, caregiver and \"love of his life\" for the past 50 years. Joe was always active helping friends where he could prior to the past three years when the wind was taken out of his sails due to health problems. His leisure time, if there ever was any, was spent traveling with Rosemary. They enjoyed traveling the US, Canada and Mexico and wore out several cars, station wagons and an RV. Many good memories were made no matter where they went. He was always inquisitive since childhood as to how something was made or worked. He maintained our cars and homes until his health was failing; this weighed heavily on him. He loved anything carved out of wood and he had several hand carved pieces. He loved to pull pranks on friends, had a talent for storytelling and just loved talking up a storm, always with a distinct laugh and beautiful smile. He will be missed by many long-time loyal friends. Joe was a 28-year employee of Pabst Brewing Company. Joe was preceded in death by his parents Max and Violet (nee Nowakowski), his brother Reginald (Donna), his sister Maxine (Terry) Kaczmarowski and niece Patricia \"Patsy\" Blundon. He is survived by a nephew Reg Paradowski, Jr. and his family, and a niece Cindy (Michael) Hennen and their family. Also survived by great niece Megan (Ross) Wurz and son Finley and great nephew Ryan (Amy) Blunden and family, and their father Steve (Darlene) Blundon. Further survived by many cousins and a multitude of faithful lifelong friends. A special thank you to the neighbors who found Joe and called 911, the fire department response team and staff of Aurora St. Lukes Emergency Dept. Shout out to our neighbors Ramon and Carmen who always seem to be there when we need them. Love you two! Much gratitude to Joe's doctors, Dr. Lingam Kumar (a great friend) and Dr. V.K. Rao. You will be missed Joe! Rest in peace my love. You are without pain now. As Joe would say, save your money on flowers, instead donate to one of Joe's numerous charities that touched his heart, it will do more good! American Cancer Society , Alzheimer's Association , American Heart Association , Feeding America, Saint Jude Children's Research Hospital , Shriners Children's Hospital , Tunnel to Towers Foundation or Habitat for Humanity . Please designate donations \"In Memory Of Joseph G. Paradowski\", he'll love you for it! Visitation will be held at the funeral home on Wednesday, May 21st, 2025 from 4-7 PM. Entombment on Thursday, May 22nd, 2025 at 11 AM at St. Adalbert Cemetery, 3801 S. 6th St., Milwaukee. (Please meet at the cemetery). To plant trees in memory, please visit the Sympathy Store . Sign Joseph Paradowski 's Guest Book Not sure what to say? See Suggestions Recent Activity May 18, 2025 Roman And Sue Blenski posted to the memorial. May 18, 2025 Ray and Anita Erdmann posted to the memorial. May 16, 2025 American Heart Association posted to the memorial. View All Activity View All 4 Entries Roman And Sue Blenski May 18, 2025 Roman Blenski 4409 my best friend from Pabst Brewery sure will be missed. Ray and Anita Erdmann May 18, 2025 Sorry to hear of your loss. May God bless you. American Heart Association May 16, 2025 May your memories of the wonderful times you shared with your loved one comfort you and your family, today and always. Bobby Yunker May 15, 2025 Where to start? Joe had a persona that would fill a room. A sense of humor that would leave you teary eyed and sore from laughter. A man who was inquisitive and curious about everything . He was always learning,and a wealth of knowledge. Joe was the first to stand up and help someone, the sort of guy who would help a stranger change a flat tire, in the rain. He had an inherent sense of duty, and an unerring sense of decency. A man with endless love for his family and Rosemary. A heart as big as Texas. I am proud to have called him friend. Joe was truly one of a kind. Rest well old buddy, hope they have good coffee upstairs ! How you can show support Send flowers Consider sending flowers. Add photos Share their life with photo memories. Plant trees Honor them by planting trees in their memory. Follow this page Get email updates whenever changes are made. Share this page Invite other friends and family to visit the page. Showing 1 - 4 of 4 results Funeral Services Provided By Bruskiewitz Funeral Home - Milwaukee 5355 West Forest Home Avenue, Milwaukee, WI 53220-1410 More Info Make a Donation in Joseph Paradowski's name Please consider a donation as requested by the family. People and places connected with Joseph Milwaukee, WI Bruskiewitz Funeral Home - Milwaukee More Info Recent Obituaries Shirley J. Pliszka Michael Gutkowski Audrey M. King Jane C. Riekkoff Batt Margaret A. Dixon See All Obituaries Milwaukee, WI Milwaukee Obituaries Follow this Page Recent Obituaries Kathleen Marie Halloran Florence B. Kraco Cynthia McWilliams Ms. Yolanda Y. Williams Eileen Esther Gray See All Obituaries Last name \"Paradowski\" Obituaries Visit this Page Recent Obituaries Stanley M. Paradowski Gertrude A. Paradowski Donna G. Paradowski Robert Paradowski Robert W. Paradowski See All Obituaries How to support Joseph's loved ones Honor a beloved veteran with a special tribute of ‘Taps’ at the National WWI Memorial in Washington, D.C. The nightly ceremony in Washington, D.C. will be dedicated in honor of your loved one on the day of your choosing. Read more Attending a Funeral: What to Know You have funeral questions, we have answers. Read more Should I Send Sympathy Flowers? What kind of arrangement is appropriate, where should you send it, and when should you send an alternative? Read more What Should I Write in a Sympathy Card? We'll help you find the right words to comfort your family member or loved one during this difficult time. Read more View All Resources to help you cope with loss Estate Settlement Guide If you’re in charge of handling the affairs for a recently deceased loved one, this guide offers a helpful checklist. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituaries, grief & privacy: Legacy’s news editor on NPR podcast Legacy's Linnea Crowther discusses how families talk about causes of death in the obituaries they write. Read more The Five Stages of Grief They're not a map to follow, but simply a description of what people commonly feel. Read more View All Ways to honor Joseph Paradowski's life and legacy Obituary Examples You may find these well-written obituary examples helpful as you write about your own family. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituary Templates – Customizable Examples and Samples These free blank templates make writing an obituary faster and easier. Read more How Do I Write a Eulogy? Some basic help and starters when you have to write a tribute to someone you love. Read more View All Recent deaths in the news Gerry Connolly (1950–2025), congressman from Virginia Read more Kathleen Hughes (1928–2025), 1950s scream queen Read more George Wendt (1948–2025), Norm from Cheers Read more Kit Bond (1939–2025), former governor and U.S. Senator from Missouri Read more View All More ways to support the family Visit the Sympathy Shop Show your sympathy by sending flowers. Send Your Arrangement Plant a tree in memory of Joseph. Choose Your Tree Dedicate a star in Joseph's name. Name a Star Donate to charity in honor of Joseph. Make a Donation Sign Joseph Paradowski 's Guest Book Not sure what to say? See Suggestions Recent Activity May 18, 2025 Roman And Sue Blenski posted to the memorial. May 18, 2025 Ray and Anita Erdmann posted to the memorial. May 16, 2025 American Heart Association posted to the memorial. View All Activity View All Contact Us FAQ Privacy Policy Terms of Use © 2025 Legacy.com All rights reserved.",
      "middle_names": [
        "George"
      ],
      "suffix": "V",
      "nickname": "Joe",
      "maiden_name": "",
      "middle_name": "George \"Joe\" Paradowski Obituary (2025) -"
    },
    {
      "url": "https://www.legacy.com/us/obituaries/name/jane-doe-obituary?id=12345678",
      "obituary_text": "Search for Obituaries - Legacy.com <iframe src=\"//www.googletagmanager.com/ns.html?id=GTM-TDQHZW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Menu Search Filter Results Publish Date Result Type Location Newspaper More Filters \"jane doe\" obituaries (122) Applied Filters: 1 2 3 Showing 1 - 50 of 122 results Browse obituaries by category: Find the people you care about in the communities that matter to you. High School College Funeral Home Location Newspapers Celebrities Submit an Obituary Contact Us FAQ Privacy Policy Terms of Use © 2025 Legacy.com All rights reserved.",
      "first_name": "Search",
      "last_name": "reserved.",
      "middle_name": "for Obituaries - Legacy.com <iframe src=\"//www.googletagmanager.com/ns.html?id=GTM-TDQHZW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Menu Search Filter Results Publish Date Result Type Location Newspaper More Filters \"jane doe\" obituaries (122) Applied Filters: 1 2 3 Showing 1 - 50 of 122 results Browse obituaries by category: Find the people you care about in the communities that matter to you. High School College Funeral Home Location Newspapers Celebrities Submit an Obituary Contact Us FAQ Privacy Policy Terms of Use © 2025 Legacy.com All rights",
      "nickname": "//www.googletagmanager.com/ns.html?id=GTM-TDQHZW"
    }
  ],
  "last_processed_date": null
}