[
  {
    "url": "https://www.legacy.com/us/obituaries/jsonline/name/maxine-kaczmarowski-obituary?id=3326788",
    "full_name": "Maxine Kaczmarowski",
    "location": "Milwaukee, WI",
    "obituary_text": "Reunited with her husband Terrence and daughter Patricia on May 24, 2018 at the age of 87 years. Survived by her faithful son-in-law Steve Blundon; grandchildren Ryan (Amy) Blundon and Megan (Ross) Wurz; great-grandchildren Autumn, Caralyn and Finley; and brothers Reginald (Donna) Paradowski and Joseph (Rosemary) Paradowski. Also survived by other relatives and friends. Maxine was always up for Bingo, loved traveling the world and made the best walnut torte, chicken dumpling soup and apple pie.",
    "id": "I0001",
    "birth_date": "24 May 1931",
    "death_date": "24 May 2018",
    "age": 87,
    "gender": "F",
    "spouse": "I0003",
    "companion": null,
    "first_name": "Maxine",
    "last_name": "Kaczmarowski",
    "middle_names": "",
    "suffix": null,
    "nickname": null,
    "maiden_name": null,
    "middle_name": "",
    "deceased": true
  },
  {
    "url": "https://www.legacy.com/us/obituaries/name/joseph-paradowski-obituary?id=58402784",
    "full_name": "Joseph George \"Joe\" Paradowski",
    "location": "Milwaukee, WI",
    "obituary_text": "Born February 16th, 1941. Passed away unexpectedly while mowing grass on May 11th, 2025, awaiting a Mother's Day Celebration in Heaven. Survived by Rosemary Dompke, his constant companion, caregiver and \"love of his life\" for the past 50 years. Joe was always active helping friends where he could prior to the past three years when the wind was taken out of his sails due to health problems. His leisure time, if there ever was any, was spent traveling with Rosemary. They enjoyed traveling the US, Canada and Mexico and wore out several cars, station wagons and an RV. Many good memories were made no matter where they went. He was always inquisitive since childhood as to how something was made or worked. He maintained our cars and homes until his health was failing; this weighed heavily on him. He loved anything carved out of wood and he had several hand carved pieces. He loved to pull pranks on friends, had a talent for storytelling and just loved talking up a storm, always with a distinct laugh and beautiful smile. He will be missed by many long-time loyal friends. Joe was a 28-year employee of Pabst Brewing Company. Joe was preceded in death by his parents Max and Violet (nee Nowakowski), his brother Reginald (Donna), his sister Maxine (Terry) Kaczmarowski and niece Patricia \"Patsy\" Blundon. He is survived by a nephew Reg Paradowski, Jr. and his family, and a niece Cindy (Michael) Hennen and their family. Also survived by great niece Megan (Ross) Wurz and son Finley and great nephew Ryan (Amy) Blunden and family, and their father Steve (Darlene) Blundon. Further survived by many cousins and a multitude of faithful lifelong friends. A special thank you to the neighbors who found Joe and called 911, the fire department response team and staff of Aurora St. Lukes Emergency Dept. Shout out to our neighbors Ramon and Carmen who always seem to be there when we need them. Love you two! Much gratitude to Joe's doctors, Dr. Lingam Kumar (a great friend) and Dr. V.K. Rao. You will be missed Joe! Rest in peace my love. You are without pain now. As Joe would say, save your money on flowers, instead donate to one of Joe's numerous charities that touched his heart, it will do more good! American Cancer Society , Alzheimer's Association , American Heart Association , Feeding America, Saint Jude Children's Research Hospital , Shriners Children's Hospital , Tunnel to Towers Foundation or Habitat for Humanity . Please designate donations \"In Memory Of Joseph G. Paradowski\", he'll love you for it!",
    "id": "I0002",
    "birth_date": "16 Feb 1941",
    "death_date": "11 May 2025",
    "age": 84,
    "gender": "M",
    "spouse": null,
    "companion": "I0004",
    "first_name": "Joseph",
    "last_name": "Paradowski",
    "middle_names": "George",
    "suffix": null,
    "nickname": "Joe",
    "maiden_name": null,
    "middle_name": "George",
    "deceased": true
  },
  {
    "url": "https://www.legacy.com/us/obituaries/jsonline/name/terrence-kaczmarowski-obituary?id=3182470",
    "full_name": "Terrence Kaczmarowski",
    "location": "Milwaukee, WI",
    "obituary_text": "age 80 years. Beloved husband of Maxine (nee Paradowski). Loving father of the late Patricia (Steve) Blundon. Cherished grandfather of Ryan (Amy) and Megan (Ross) Wurz. Proud gramps of Autumn and Caralyn. Brother-in-law of Reginald (Donna) Paradowski and Joseph (Rose Mary) Paradowski. Also survived by other relatives and friends.",
    "id": "I0003",
    "birth_date": null,
    "death_date": null,
    "age": 80,
    "gender": "F",
    "spouse": null,
    "companion": null,
    "first_name": "Terrence",
    "last_name": "Kaczmarowski",
    "middle_names": "",
    "suffix": null,
    "nickname": null,
    "maiden_name": null,
    "middle_name": "",
    "deceased": true
  },
  {
    "full_name": "Rosemary Dompke",
    "id": "I0004",
    "location": null,
    "obituary_text": null,
    "birth_date": null,
    "death_date": null,
    "age": null,
    "gender": null,
    "spouse": null,
    "companion": "I0002",
    "deceased": false,
    "first_name": "Rosemary",
    "middle_name": "",
    "last_name": "Dompke",
    "nickname": null,
    "suffix": null
  }
]